/*
Navicat MySQL Data Transfer

Source Server         : Mysql
Source Server Version : 50716
Source Host           : localhost:3306
Source Database       : library

Target Server Type    : MYSQL
Target Server Version : 50716
File Encoding         : 65001

Date: 2016-12-23 10:20:14
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `t_library_book`
-- ----------------------------
DROP TABLE IF EXISTS `t_library_book`;
CREATE TABLE `t_library_book` (
  `id` varchar(20) NOT NULL,
  `bookname` varchar(50) NOT NULL COMMENT '书名',
  `authorname` varchar(30) NOT NULL COMMENT '作者',
  `issuedate` date NOT NULL COMMENT '出版时间',
  `classify` varchar(50) NOT NULL COMMENT '分类',
  `description` varchar(225) DEFAULT NULL COMMENT '简介',
  `status` enum('1','2','3','4','5','6') NOT NULL COMMENT '状态',
  `createtime` datetime NOT NULL COMMENT '创建时间',
  `lastupdatetime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '最后更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `bookname` (`bookname`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of t_library_book
-- ----------------------------
INSERT INTO `t_library_book` VALUES ('1109115201', '平凡的世界2', '路遥', '2010-01-01', '小说', '第二部写 1979年春十一届三中全会后百废待兴又矛盾重重，田福堂连夜召开支部会抵制责任制，孙少安却领导生产队率先实行接着也就在全村推广了责任制。头脑灵活的少安又进城拉砖，用赚的钱建窑烧砖，成了公社的“冒尖户”。', '1', '2016-12-09 11:52:01', '2016-12-21 10:19:29');
INSERT INTO `t_library_book` VALUES ('1109120024', '西游记', '吴承恩', '1990-10-09', '文学', '《西游记》是一部中国古典神魔小说，为中国“四大名著”之一。书中讲述唐朝法师西天取经的故事，表现了惩恶扬善的古老主题。《西游记》成书于16世纪明朝中叶，自问世以来在中', '1', '2016-12-09 12:00:24', '2016-12-22 15:41:08');
INSERT INTO `t_library_book` VALUES ('1109120630', '水浒传', '施耐庵', '2012-09-08', '小说', '《水浒传》是一部以描写古代农民起义为题材的长篇小说。它形象地描绘了农民起义从发生、发展直至失败的全过程，深刻揭示了起义的社会根源，满腔热情地歌颂了起义英雄的反抗斗争和他们的社会理想，也具体揭示了起义失败的内在历史原因。', '1', '2016-12-09 12:06:30', '2016-12-20 15:33:08');
INSERT INTO `t_library_book` VALUES ('11100', '追风筝的人', '卡勒德·胡赛尼', '2010-01-01', '文学', '故事发生在阿富汗，从童年开始讲起，男二的父亲是男一家的管家仆人，因此男一是男二的小主人，男二对男一忠心耿耿，并且他们是很好的朋友。在一次放风筝比赛时，他们两人得了冠军，男二为小主人逐回落下的风筝，但是却遭到其他较大的孩子的维度，为了保护小主人（男一）的风筝，男二被他们强奸。这些都被男一看到眼中，但是他没有勇气出面就男二', '3', '2016-12-06 16:00:53', '2016-12-22 15:32:09');
INSERT INTO `t_library_book` VALUES ('1112132157', '呼啸山庄', '勃朗特', '2012-07-01', '文学', '小说描写吉卜赛弃儿希斯克利夫被山庄老主人收养后，因受辱和恋爱不遂．外出致富。回来后对与其女友凯瑟琳结婚的地主林顿及其子女进行报复的故事。', '1', '2016-12-12 13:21:57', '2016-12-13 13:03:41');
INSERT INTO `t_library_book` VALUES ('1115155912', '三国演义', 'xx', '2011-11-11', '文学', '三国演义三国演义', '1', '2016-12-15 15:59:12', '2016-12-15 15:59:12');
INSERT INTO `t_library_book` VALUES ('11200', '人类简史:从动物到上帝', ' 尤瓦尔·赫拉利 (作者), 林俊宏 (译者) ', '2014-11-01', '历史', '人类简史：从动物到上帝》是以色列新锐历史学家的一部重磅作品。从十万年前有生命迹象开始到21世纪资本、科技交织的人类发展史。十万年前，地球上至少有六个人种，为何今天却只剩下了我们自己？我们曾经只是非洲角落一个毫不起眼的族群，对地球上生态的影响力和萤火虫、猩猩或者水母相差无几。', '3', '2016-12-07 11:53:38', '2016-12-07 13:05:22');
INSERT INTO `t_library_book` VALUES ('11300', '哲学与人生', '傅佩荣 ', '2012-05-01', '文学', '哲学课可以是最令人生厌的，也可以是最引人入胜的，就看谁来上这门课了。谁来上是重要的。与别的课以传授知识为主不同，在哲学课上，传授知识只居于次要地位，首要目标是点燃对智慧的爱，引导学生思考世界和人生的重大问题。要达到这个目标，哲学教师自己就必须是一个有着活泼心智的爱智者。他能在课堂上产生一个磁场，把思想的乐趣传递给学生。他是一个证人，学生看见他便相信了哲学决非一种枯燥的东西。', '3', '2016-12-07 11:58:09', '2016-12-07 13:09:19');
INSERT INTO `t_library_book` VALUES ('11400', '平凡的世界', '路遥', '2016-11-12', '文学', '第一部写1975年初农民子弟孙少平到原西县高中读书，他贫困，自尊；学习和劳动都好，与地主家庭出身的郝红梅互相爱怜，被侯玉英发现并当众说破后，两人不好继续保持互相爱怜的关系，后来郝红梅却与家境优越的顾养民恋爱，少平高中毕业，回乡生产', '1', '2016-12-07 17:36:36', '2016-12-13 13:03:54');
INSERT INTO `t_library_book` VALUES ('11700', '解忧杂货店 ', '东野圭吾 (作者), 李盈春 (译者)', '2014-05-01', '文学', '僻静的街道旁有一家杂货店，只要写下烦恼投进店前门卷帘门的投信口，第二天就会在店后的牛奶箱里得到回答：因男友身患绝症，年轻女孩静子在爱情与梦想间徘徊；克郎为了音乐梦想离家漂泊，却在现实中寸步难行；少年浩介面临家庭巨变，挣扎在亲情与未来的迷茫中……', '3', '2016-12-07 11:08:26', '2016-12-09 11:32:18');
INSERT INTO `t_library_book` VALUES ('11900', '小王子', '安安', '2016-11-12', '文学', '《红楼梦》开篇以神话形式介绍作品的由来,说女娲炼三万六千五百零一块石补天,只用了三万六千五百块,剩余一块未用。剩一石自怨自愧,日夜悲哀。一僧一道', '1', '2016-12-07 17:35:27', '2016-12-12 13:58:49');
INSERT INTO `t_library_book` VALUES ('2209120414', '红楼梦', '曹雪芹', '1880-10-10', '小说', '《红楼梦》开篇以神话形式介绍作品的由来,说女娲炼三万六千五百零一块石补天,只用了三万六千五百块,剩余一块未用。剩一石自怨自愧,日夜悲哀。一僧一道', '1', '2016-12-09 12:04:14', '2016-12-12 13:58:06');
INSERT INTO `t_library_book` VALUES ('22200', '活着', '余华', '2012-09-08', '小说', '讲述了农村人福贵悲惨的人生遭遇。福贵本是个阔少爷，可他嗜赌如命，终于赌光了家业，一贫如洗。他的父亲被他活活气死，母亲则在穷困中患了重病，福贵前去求药，却在途中被国民党抓去当壮丁。经过几番波折回到家里，才知道母亲早已去世，妻子家珍含辛茹苦地养大两个儿女。此后更加悲惨的命运一次又一次降临到福贵身上，他的妻子、儿女和孙子相继死去，最后只剩福贵和一头老牛相依为命，但老人依旧活着，仿佛比往日更加洒脱与坚强。', '1', '2016-12-07 11:10:43', '2016-12-12 14:19:09');
INSERT INTO `t_library_book` VALUES ('22700', '围城', '钱钟书', '1991-06-08', '小说', '三十年来横贯常销畅销小说之首。《围城》是钱钟书的一部长篇小说，堪称中国现当代长篇小说的经典。小说塑造了抗战开初一类知识分子的群像，生动反映了在国家特定时期，特殊人群的行为操守、以及困惑。从另一个角度记述了当时的情景、氛围。虽然有具体的历史背景，但这部小说揭示的只是人群的弱点，在今天依然能够引起人们的共鸣。首版于1947年由上海晨光出版公司出版。《围城》是中国现代文学史上一部风格独特的讽刺小说。被誉为“新儒林外史”。', '3', '2016-12-07 11:20:31', '2016-12-07 15:28:58');
INSERT INTO `t_library_book` VALUES ('55500', '中国通史', '吕思勉', '2014-01-30', '历史', '中国通史》分上编下编，上编为十八章，以中国文化史为题，体论述自古以来中国社会的各个层面的发展，文化现象，内容包括婚姻、族制、政体、阶级、财产、官制、选举、赋税、兵制、刑法、实业、货币、衣食、住行、教育、语文、学术、宗教等十八类，囊括社会经济、政治体制、学术文化等各个方面；下编以中国政治史为题，下编为三十五章，则按照历史顺序串联，叙述了中国历代王朝的变迁，中国政治的变革。', '6', '2016-12-07 11:55:03', '2016-12-09 10:52:31');
INSERT INTO `t_library_book` VALUES ('66200', 'Java从入门到精通', '明日科技', '2012-12-01', '计算机与互联网', '\"从初学者角度出发，通过通俗易懂的语言、丰富多彩的实例，详细介绍了使用Java语言进行程序开发需要掌握的知识。全书分为28章，包括初识Java，熟悉Eclipse开发工具，Java语言基础，流程控制，字符串，数组，类和对象，包装类，数字处理类，接口、继承与多态，类的高级特性，异常处理，Swing程序设计，集合类，I/O（输入/输出），反射，枚举类型与泛型，\"', '1', '2016-12-07 11:50:21', '2016-12-12 14:19:25');
INSERT INTO `t_library_book` VALUES ('66300', '智能时代', '吴军', '2016-10-21', '计算机与互联网', '《智能时代：大数据与智能革命重新定义未来》大数据和人工智能迅猛发展，对社会和商业的影响日益深刻，从学术界到企业界，智能化浪潮的来临，已经成为共识。可以比肩于大航海时期和工业革命的此次变革浪潮，必然会对我们的技术发展、商业和社会都会产生重大的影响。', '1', '2016-12-07 11:22:07', '2016-12-07 11:22:07');
INSERT INTO `t_library_book` VALUES ('66700', 'Java编程思想(第4版)', ' 埃史尔 (作者), 陈昊鹏 (译者) ', '2007-06-12', '计算机与互联网', 'Java编程思想(第4版)》书共22章，包括操作符、控制执行流程、访问权限控制、复用类、多态、接口、通过异常处理错误、字符串、泛型、数组、容器深入研究、Iava’UO系统、枚举类型、并发以及图形化用户界面等内容。这些丰富的内容，包含了Java语言基础语法以及高级特性，适合各个层次的Java程序员阅读，同时也是高等院校讲授面向对象程序设计语言以及Java语言的绝佳教材和参考书。', '1', '2016-12-07 11:52:00', '2016-12-09 11:32:05');
